k6/run-webflux-500l-1000vu-30pool.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-simple.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m25s max duration (incl. graceful stop):
              * ramp: Up to 1000 looping VUs for 2m15s over 4 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m01.0s), 0001/1000 VUs, 0 complete and 0 interrupted iterations
ramp   [   1% ] 0001/1000 VUs  0m01.0s/2m15.0s

running (0m02.0s), 0002/1000 VUs, 381 complete and 0 interrupted iterations
ramp   [   1% ] 0002/1000 VUs  0m02.0s/2m15.0s

running (0m03.0s), 0003/1000 VUs, 1295 complete and 0 interrupted iterations
ramp   [   2% ] 0003/1000 VUs  0m03.0s/2m15.0s

running (0m04.0s), 0005/1000 VUs, 2896 complete and 0 interrupted iterations
ramp   [   3% ] 0005/1000 VUs  0m04.0s/2m15.0s

running (0m05.0s), 0006/1000 VUs, 5027 complete and 0 interrupted iterations
ramp   [   4% ] 0006/1000 VUs  0m05.0s/2m15.0s

running (0m06.0s), 0007/1000 VUs, 7575 complete and 0 interrupted iterations
ramp   [   4% ] 0007/1000 VUs  0m06.0s/2m15.0s

running (0m07.0s), 0009/1000 VUs, 10561 complete and 0 interrupted iterations
ramp   [   5% ] 0009/1000 VUs  0m07.0s/2m15.0s

running (0m08.0s), 0010/1000 VUs, 13595 complete and 0 interrupted iterations
ramp   [   6% ] 0010/1000 VUs  0m08.0s/2m15.0s

running (0m09.0s), 0011/1000 VUs, 16784 complete and 0 interrupted iterations
ramp   [   7% ] 0011/1000 VUs  0m09.0s/2m15.0s

running (0m10.0s), 0013/1000 VUs, 19885 complete and 0 interrupted iterations
ramp   [   7% ] 0013/1000 VUs  0m10.0s/2m15.0s

running (0m11.0s), 0014/1000 VUs, 22922 complete and 0 interrupted iterations
ramp   [   8% ] 0014/1000 VUs  0m11.0s/2m15.0s

running (0m12.0s), 0015/1000 VUs, 25964 complete and 0 interrupted iterations
ramp   [   9% ] 0015/1000 VUs  0m12.0s/2m15.0s

running (0m13.0s), 0017/1000 VUs, 29009 complete and 0 interrupted iterations
ramp   [  10% ] 0017/1000 VUs  0m13.0s/2m15.0s

running (0m14.0s), 0018/1000 VUs, 32482 complete and 0 interrupted iterations
ramp   [  10% ] 0018/1000 VUs  0m14.0s/2m15.0s

running (0m15.0s), 0019/1000 VUs, 35596 complete and 0 interrupted iterations
ramp   [  11% ] 0019/1000 VUs  0m15.0s/2m15.0s

running (0m16.0s), 0040/1000 VUs, 38916 complete and 0 interrupted iterations
ramp   [  12% ] 0040/1000 VUs  0m16.0s/2m15.0s

running (0m17.0s), 0062/1000 VUs, 42522 complete and 0 interrupted iterations
ramp   [  13% ] 0062/1000 VUs  0m17.0s/2m15.0s

running (0m18.0s), 0084/1000 VUs, 45892 complete and 0 interrupted iterations
ramp   [  13% ] 0084/1000 VUs  0m18.0s/2m15.0s

running (0m19.0s), 0106/1000 VUs, 49267 complete and 0 interrupted iterations
ramp   [  14% ] 0106/1000 VUs  0m19.0s/2m15.0s

running (0m20.0s), 0127/1000 VUs, 52697 complete and 0 interrupted iterations
ramp   [  15% ] 0127/1000 VUs  0m20.0s/2m15.0s

running (0m21.0s), 0149/1000 VUs, 56153 complete and 0 interrupted iterations
ramp   [  16% ] 0149/1000 VUs  0m21.0s/2m15.0s

running (0m22.0s), 0171/1000 VUs, 59678 complete and 0 interrupted iterations
ramp   [  16% ] 0171/1000 VUs  0m22.0s/2m15.0s

running (0m23.0s), 0193/1000 VUs, 63072 complete and 0 interrupted iterations
ramp   [  17% ] 0193/1000 VUs  0m23.0s/2m15.0s

running (0m24.0s), 0215/1000 VUs, 66405 complete and 0 interrupted iterations
ramp   [  18% ] 0215/1000 VUs  0m24.0s/2m15.0s

running (0m25.0s), 0236/1000 VUs, 69887 complete and 0 interrupted iterations
ramp   [  18% ] 0236/1000 VUs  0m25.0s/2m15.0s

running (0m26.0s), 0258/1000 VUs, 73416 complete and 0 interrupted iterations
ramp   [  19% ] 0258/1000 VUs  0m26.0s/2m15.0s

running (0m27.0s), 0280/1000 VUs, 76846 complete and 0 interrupted iterations
ramp   [  20% ] 0280/1000 VUs  0m27.0s/2m15.0s

running (0m28.0s), 0302/1000 VUs, 80152 complete and 0 interrupted iterations
ramp   [  21% ] 0302/1000 VUs  0m28.0s/2m15.0s

running (0m29.0s), 0323/1000 VUs, 83454 complete and 0 interrupted iterations
ramp   [  21% ] 0323/1000 VUs  0m29.0s/2m15.0s

running (0m30.0s), 0345/1000 VUs, 86780 complete and 0 interrupted iterations
ramp   [  22% ] 0345/1000 VUs  0m30.0s/2m15.0s

running (0m31.0s), 0367/1000 VUs, 90027 complete and 0 interrupted iterations
ramp   [  23% ] 0367/1000 VUs  0m31.0s/2m15.0s

running (0m32.0s), 0389/1000 VUs, 93219 complete and 0 interrupted iterations
ramp   [  24% ] 0389/1000 VUs  0m32.0s/2m15.0s

running (0m33.0s), 0411/1000 VUs, 96626 complete and 0 interrupted iterations
ramp   [  24% ] 0411/1000 VUs  0m33.0s/2m15.0s

running (0m34.0s), 0432/1000 VUs, 100125 complete and 0 interrupted iterations
ramp   [  25% ] 0432/1000 VUs  0m34.0s/2m15.0s

running (0m35.0s), 0454/1000 VUs, 103753 complete and 0 interrupted iterations
ramp   [  26% ] 0454/1000 VUs  0m35.0s/2m15.0s

running (0m36.0s), 0476/1000 VUs, 107719 complete and 0 interrupted iterations
ramp   [  27% ] 0476/1000 VUs  0m36.0s/2m15.0s

running (0m37.0s), 0498/1000 VUs, 111551 complete and 0 interrupted iterations
ramp   [  27% ] 0498/1000 VUs  0m37.0s/2m15.0s

running (0m38.0s), 0519/1000 VUs, 115113 complete and 0 interrupted iterations
ramp   [  28% ] 0519/1000 VUs  0m38.0s/2m15.0s

running (0m39.0s), 0541/1000 VUs, 118616 complete and 0 interrupted iterations
ramp   [  29% ] 0541/1000 VUs  0m39.0s/2m15.0s

running (0m40.0s), 0563/1000 VUs, 122202 complete and 0 interrupted iterations
ramp   [  30% ] 0563/1000 VUs  0m40.0s/2m15.0s

running (0m41.0s), 0585/1000 VUs, 126024 complete and 0 interrupted iterations
ramp   [  30% ] 0585/1000 VUs  0m41.0s/2m15.0s

running (0m42.0s), 0607/1000 VUs, 129827 complete and 0 interrupted iterations
ramp   [  31% ] 0607/1000 VUs  0m42.0s/2m15.0s

running (0m43.0s), 0628/1000 VUs, 133696 complete and 0 interrupted iterations
ramp   [  32% ] 0628/1000 VUs  0m43.0s/2m15.0s

running (0m44.0s), 0650/1000 VUs, 137710 complete and 0 interrupted iterations
ramp   [  33% ] 0650/1000 VUs  0m44.0s/2m15.0s

running (0m45.0s), 0672/1000 VUs, 141593 complete and 0 interrupted iterations
ramp   [  33% ] 0672/1000 VUs  0m45.0s/2m15.0s

running (0m46.0s), 0694/1000 VUs, 145551 complete and 0 interrupted iterations
ramp   [  34% ] 0694/1000 VUs  0m46.0s/2m15.0s

running (0m47.0s), 0715/1000 VUs, 149476 complete and 0 interrupted iterations
ramp   [  35% ] 0715/1000 VUs  0m47.0s/2m15.0s

running (0m48.0s), 0737/1000 VUs, 153327 complete and 0 interrupted iterations
ramp   [  36% ] 0737/1000 VUs  0m48.0s/2m15.0s

running (0m49.0s), 0759/1000 VUs, 157359 complete and 0 interrupted iterations
ramp   [  36% ] 0759/1000 VUs  0m49.0s/2m15.0s

running (0m50.0s), 0781/1000 VUs, 161180 complete and 0 interrupted iterations
ramp   [  37% ] 0781/1000 VUs  0m50.0s/2m15.0s

running (0m51.0s), 0803/1000 VUs, 165227 complete and 0 interrupted iterations
ramp   [  38% ] 0803/1000 VUs  0m51.0s/2m15.0s

running (0m52.0s), 0824/1000 VUs, 169156 complete and 0 interrupted iterations
ramp   [  38% ] 0824/1000 VUs  0m52.0s/2m15.0s

running (0m53.0s), 0846/1000 VUs, 173068 complete and 0 interrupted iterations
ramp   [  39% ] 0846/1000 VUs  0m53.0s/2m15.0s

running (0m54.0s), 0868/1000 VUs, 177071 complete and 0 interrupted iterations
ramp   [  40% ] 0868/1000 VUs  0m54.0s/2m15.0s

running (0m55.0s), 0890/1000 VUs, 180906 complete and 0 interrupted iterations
ramp   [  41% ] 0890/1000 VUs  0m55.0s/2m15.0s

running (0m56.0s), 0911/1000 VUs, 184625 complete and 0 interrupted iterations
ramp   [  41% ] 0911/1000 VUs  0m56.0s/2m15.0s

running (0m57.0s), 0933/1000 VUs, 188542 complete and 0 interrupted iterations
ramp   [  42% ] 0933/1000 VUs  0m57.0s/2m15.0s

running (0m58.0s), 0955/1000 VUs, 192629 complete and 0 interrupted iterations
ramp   [  43% ] 0955/1000 VUs  0m58.0s/2m15.0s

running (0m59.0s), 0977/1000 VUs, 196513 complete and 0 interrupted iterations
ramp   [  44% ] 0977/1000 VUs  0m59.0s/2m15.0s

running (1m00.0s), 0999/1000 VUs, 200372 complete and 0 interrupted iterations
ramp   [  44% ] 0999/1000 VUs  1m00.0s/2m15.0s

running (1m01.0s), 1000/1000 VUs, 204350 complete and 0 interrupted iterations
ramp   [  45% ] 1000/1000 VUs  1m01.0s/2m15.0s

running (1m02.0s), 1000/1000 VUs, 208269 complete and 0 interrupted iterations
ramp   [  46% ] 1000/1000 VUs  1m02.0s/2m15.0s

running (1m03.0s), 1000/1000 VUs, 212298 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m03.0s/2m15.0s

running (1m04.0s), 1000/1000 VUs, 216319 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m04.0s/2m15.0s

running (1m05.0s), 1000/1000 VUs, 220170 complete and 0 interrupted iterations
ramp   [  48% ] 1000/1000 VUs  1m05.0s/2m15.0s

running (1m06.0s), 1000/1000 VUs, 224251 complete and 0 interrupted iterations
ramp   [  49% ] 1000/1000 VUs  1m06.0s/2m15.0s

running (1m07.0s), 1000/1000 VUs, 227938 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m07.0s/2m15.0s

running (1m08.0s), 1000/1000 VUs, 231688 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m08.0s/2m15.0s

running (1m09.0s), 1000/1000 VUs, 235672 complete and 0 interrupted iterations
ramp   [  51% ] 1000/1000 VUs  1m09.0s/2m15.0s

running (1m10.0s), 1000/1000 VUs, 239625 complete and 0 interrupted iterations
ramp   [  52% ] 1000/1000 VUs  1m10.0s/2m15.0s

running (1m11.0s), 1000/1000 VUs, 243549 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m11.0s/2m15.0s

running (1m12.0s), 1000/1000 VUs, 247455 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m12.0s/2m15.0s

running (1m13.0s), 1000/1000 VUs, 251457 complete and 0 interrupted iterations
ramp   [  54% ] 1000/1000 VUs  1m13.0s/2m15.0s

running (1m14.0s), 1000/1000 VUs, 255434 complete and 0 interrupted iterations
ramp   [  55% ] 1000/1000 VUs  1m14.0s/2m15.0s

running (1m15.0s), 1000/1000 VUs, 259207 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m15.0s/2m15.0s

running (1m16.0s), 1000/1000 VUs, 263141 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m16.0s/2m15.0s

running (1m17.0s), 1000/1000 VUs, 267071 complete and 0 interrupted iterations
ramp   [  57% ] 1000/1000 VUs  1m17.0s/2m15.0s

running (1m18.0s), 1000/1000 VUs, 271064 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m18.0s/2m15.0s

running (1m19.0s), 1000/1000 VUs, 275062 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m19.0s/2m15.0s

running (1m20.0s), 1000/1000 VUs, 278859 complete and 0 interrupted iterations
ramp   [  59% ] 1000/1000 VUs  1m20.0s/2m15.0s

running (1m21.0s), 1000/1000 VUs, 282910 complete and 0 interrupted iterations
ramp   [  60% ] 1000/1000 VUs  1m21.0s/2m15.0s

running (1m22.0s), 1000/1000 VUs, 286819 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m22.0s/2m15.0s

running (1m23.0s), 1000/1000 VUs, 290690 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m23.0s/2m15.0s

running (1m24.0s), 1000/1000 VUs, 294570 complete and 0 interrupted iterations
ramp   [  62% ] 1000/1000 VUs  1m24.0s/2m15.0s

running (1m25.0s), 1000/1000 VUs, 298449 complete and 0 interrupted iterations
ramp   [  63% ] 1000/1000 VUs  1m25.0s/2m15.0s

running (1m26.0s), 1000/1000 VUs, 302388 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m26.0s/2m15.0s

running (1m27.0s), 1000/1000 VUs, 306367 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m27.0s/2m15.0s

running (1m28.0s), 1000/1000 VUs, 310403 complete and 0 interrupted iterations
ramp   [  65% ] 1000/1000 VUs  1m28.0s/2m15.0s

running (1m29.0s), 1000/1000 VUs, 314376 complete and 0 interrupted iterations
ramp   [  66% ] 1000/1000 VUs  1m29.0s/2m15.0s

running (1m30.0s), 1000/1000 VUs, 318097 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m30.0s/2m15.0s

running (1m31.0s), 1000/1000 VUs, 321952 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m31.0s/2m15.0s

running (1m32.0s), 1000/1000 VUs, 325652 complete and 0 interrupted iterations
ramp   [  68% ] 1000/1000 VUs  1m32.0s/2m15.0s

running (1m33.0s), 1000/1000 VUs, 329588 complete and 0 interrupted iterations
ramp   [  69% ] 1000/1000 VUs  1m33.0s/2m15.0s

running (1m34.0s), 1000/1000 VUs, 333484 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m34.0s/2m15.0s

running (1m35.0s), 1000/1000 VUs, 337282 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m35.0s/2m15.0s

running (1m36.0s), 1000/1000 VUs, 341201 complete and 0 interrupted iterations
ramp   [  71% ] 1000/1000 VUs  1m36.0s/2m15.0s

running (1m37.0s), 1000/1000 VUs, 345101 complete and 0 interrupted iterations
ramp   [  72% ] 1000/1000 VUs  1m37.0s/2m15.0s

running (1m38.0s), 1000/1000 VUs, 349135 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m38.0s/2m15.0s

running (1m39.0s), 1000/1000 VUs, 353085 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m39.0s/2m15.0s

running (1m40.0s), 1000/1000 VUs, 357011 complete and 0 interrupted iterations
ramp   [  74% ] 1000/1000 VUs  1m40.0s/2m15.0s

running (1m41.0s), 1000/1000 VUs, 360960 complete and 0 interrupted iterations
ramp   [  75% ] 1000/1000 VUs  1m41.0s/2m15.0s

running (1m42.0s), 1000/1000 VUs, 364875 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m42.0s/2m15.0s

running (1m43.0s), 1000/1000 VUs, 368666 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m43.0s/2m15.0s

running (1m44.0s), 1000/1000 VUs, 372408 complete and 0 interrupted iterations
ramp   [  77% ] 1000/1000 VUs  1m44.0s/2m15.0s

running (1m45.0s), 1000/1000 VUs, 376034 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m45.0s/2m15.0s

running (1m46.0s), 1000/1000 VUs, 379869 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m46.0s/2m15.0s

running (1m47.0s), 1000/1000 VUs, 383647 complete and 0 interrupted iterations
ramp   [  79% ] 1000/1000 VUs  1m47.0s/2m15.0s

running (1m48.0s), 1000/1000 VUs, 387478 complete and 0 interrupted iterations
ramp   [  80% ] 1000/1000 VUs  1m48.0s/2m15.0s

running (1m49.0s), 1000/1000 VUs, 391330 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m49.0s/2m15.0s

running (1m50.0s), 1000/1000 VUs, 394711 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m50.0s/2m15.0s

running (1m51.0s), 1000/1000 VUs, 398291 complete and 0 interrupted iterations
ramp   [  82% ] 1000/1000 VUs  1m51.0s/2m15.0s

running (1m52.0s), 1000/1000 VUs, 402022 complete and 0 interrupted iterations
ramp   [  83% ] 1000/1000 VUs  1m52.0s/2m15.0s

running (1m53.0s), 1000/1000 VUs, 405753 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m53.0s/2m15.0s

running (1m54.0s), 1000/1000 VUs, 409574 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m54.0s/2m15.0s

running (1m55.0s), 1000/1000 VUs, 413391 complete and 0 interrupted iterations
ramp   [  85% ] 1000/1000 VUs  1m55.0s/2m15.0s

running (1m56.0s), 1000/1000 VUs, 417238 complete and 0 interrupted iterations
ramp   [  86% ] 1000/1000 VUs  1m56.0s/2m15.0s

running (1m57.0s), 1000/1000 VUs, 421067 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m57.0s/2m15.0s

running (1m58.0s), 1000/1000 VUs, 424752 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m58.0s/2m15.0s

running (1m59.0s), 1000/1000 VUs, 428470 complete and 0 interrupted iterations
ramp   [  88% ] 1000/1000 VUs  1m59.0s/2m15.0s

running (2m00.0s), 1000/1000 VUs, 432070 complete and 0 interrupted iterations
ramp   [  89% ] 1000/1000 VUs  2m00.0s/2m15.0s

running (2m01.0s), 0946/1000 VUs, 435886 complete and 0 interrupted iterations
ramp   [  90% ] 0946/1000 VUs  2m01.0s/2m15.0s

running (2m02.0s), 0879/1000 VUs, 439666 complete and 0 interrupted iterations
ramp   [  90% ] 0879/1000 VUs  2m02.0s/2m15.0s

running (2m03.0s), 0813/1000 VUs, 443366 complete and 0 interrupted iterations
ramp   [  91% ] 0813/1000 VUs  2m03.0s/2m15.0s

running (2m04.0s), 0743/1000 VUs, 447141 complete and 0 interrupted iterations
ramp   [  92% ] 0743/1000 VUs  2m04.0s/2m15.0s

running (2m05.0s), 0677/1000 VUs, 450545 complete and 0 interrupted iterations
ramp   [  93% ] 0677/1000 VUs  2m05.0s/2m15.0s

running (2m06.0s), 0607/1000 VUs, 454313 complete and 0 interrupted iterations
ramp   [  93% ] 0607/1000 VUs  2m06.0s/2m15.0s

running (2m07.0s), 0543/1000 VUs, 458175 complete and 0 interrupted iterations
ramp   [  94% ] 0543/1000 VUs  2m07.0s/2m15.0s

running (2m08.0s), 0475/1000 VUs, 461859 complete and 0 interrupted iterations
ramp   [  95% ] 0475/1000 VUs  2m08.0s/2m15.0s

running (2m09.0s), 0408/1000 VUs, 465753 complete and 0 interrupted iterations
ramp   [  96% ] 0408/1000 VUs  2m09.0s/2m15.0s

running (2m10.0s), 0338/1000 VUs, 469664 complete and 0 interrupted iterations
ramp   [  96% ] 0338/1000 VUs  2m10.0s/2m15.0s

running (2m11.0s), 0273/1000 VUs, 473632 complete and 0 interrupted iterations
ramp   [  97% ] 0273/1000 VUs  2m11.0s/2m15.0s

running (2m12.0s), 0204/1000 VUs, 477623 complete and 0 interrupted iterations
ramp   [  98% ] 0204/1000 VUs  2m12.0s/2m15.0s

running (2m13.0s), 0138/1000 VUs, 481651 complete and 0 interrupted iterations
ramp   [  98% ] 0138/1000 VUs  2m13.0s/2m15.0s

running (2m14.0s), 0071/1000 VUs, 485575 complete and 0 interrupted iterations
ramp   [  99% ] 0071/1000 VUs  2m14.0s/2m15.0s

running (2m15.0s), 0004/1000 VUs, 489053 complete and 0 interrupted iterations
ramp   [ 100% ] 0004/1000 VUs  2m15.0s/2m15.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=280.71ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 489093  3622.866885/s
    checks_succeeded...: 100.00% 489093 out of 489093
    checks_failed......: 0.00%   0 out of 489093

    ✓ 200

    HTTP
    http_req_duration..............: avg=185.3ms  min=1.82ms med=234.47ms max=490.64ms p(90)=270.78ms p(95)=280.71ms
      { expected_response:true }...: avg=185.3ms  min=1.82ms med=234.47ms max=490.64ms p(90)=270.78ms p(95)=280.71ms
    http_req_failed................: 0.00%  0 out of 489093
    http_reqs......................: 489093 3622.866885/s

    EXECUTION
    iteration_duration.............: avg=185.33ms min=1.86ms med=234.5ms  max=490.67ms p(90)=270.81ms p(95)=280.74ms
    iterations.....................: 489093 3622.866885/s
    vus............................: 3      min=1           max=1000
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 11 GB  81 MB/s
    data_sent......................: 55 MB  409 kB/s



running (2m15.0s), 0000/1000 VUs, 489093 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 0000/1000 VUs  2m15s